<PAD>
<UNK>
<SOS>
<EOS>
_
a
a~
b
ba
ba~
be
be^
be~
bi
bo
bo^
bo~
bu
bx
bx^
bx~
by
d
da
da~
de
de^
de~
di
do
do^
do~
du
dx
dx^
dx~
dy
e
e^
e~
f
fa
fa~
fe
fe^
fe~
fi
fo
fo^
fo~
fu
fx
fx^
fx~
fy
g
ga
ga~
ge
ge^
gi
gn
gna
gna~
gne
gne^
gni
gno
gno^
gno~
go
go^
go~
gu
gx
gx^
gy
ha~
he
he^
he~
hi
hx
hx^
hy
i
j
ja
ja~
je
je^
je~
ji
jo
jo^
jo~
ju
jx
jx^
jy
k
ka
ka~
ke
ke^
ke~
ki
ko
ko^
ko~
ku
kx
kx^
kx~
ky
l
la
la~
le
le^
le~
li
lo
lo^
lo~
lu
lx
lx^
lx~
ly
m
ma
ma~
me
me^
me~
mi
mo
mo^
mo~
mu
mx
mx^
mx~
my
n
na
na~
ne
ne^
ne~
ng
nga
nga~
nge^
nge~
ngi
ngo
ngo~
ngu
ngx
ngx^
ngy
ni
no
no^
no~
nu
nx
nx^
nx~
ny
o
o^
o~
p
pa
pa~
pe
pe^
pe~
pi
po
po^
po~
pu
px
px^
px~
py
r
ra
ra~
re
re^
re~
ri
ro
ro^
ro~
ru
rx
rx^
rx~
ry
s
s^
s^a
s^a~
s^e
s^e^
s^e~
s^i
s^o
s^o^
s^o~
s^u
s^x
s^x^
s^x~
s^y
sa
sa~
se
se^
se~
si
so
so^
so~
su
sx
sx^
sx~
sy
t
ta
ta~
te
te^
te~
ti
to
to^
to~
tu
tx
tx^
tx~
ty
u
v
va
va~
ve
ve^
ve~
vi
vo
vo^
vo~
vu
vx
vx^
vx~
vy
w
wa
we
we^
we~
wi
wo
wx^
x
x^
x~
y
yi
z
z^
z^a
z^a~
z^e
z^e^
z^e~
z^i
z^o
z^o^
z^o~
z^u
z^x
z^x^
z^x~
z^y
za
za~
ze
ze^
ze~
zi
zo
zo^
zo~
zu
zx
zx^
zx~
zy
e^
sa
la
je
za~
ka
ra~
te^
na
re^
de
dx
ko
vi
da~
zi
a~
bu
no~
se
di
ma~
s^
z^a~
ka~
ro~
za
ve^
te
ku
po
ti
zo
so~
ma
gnx^
z^e
s^e
ze^
jo^
ne^
rx
ro
pe
e~
sx
gn
mi
si
le~
fo^
jo~
re
ve
le
pa
sa~
le^
lx
ru
da
no
ke
fa~
wa
pe^
so^
me^
zo~
mx
z^u
ta~
re~
de^
ne
ko~
se^
va
ja~
la~
ke^
pu
yi
ko^
lo
ri
z^i
pi
x^
po^
tx
ro^
to
ni
li
yo~
ta
nu
vo
z^
jx
jo
ki
nx
fe~
we^
tu
de~
ga
su
px
e~
ye
va~
we~
do^
ze
kx
be^
lo~
s^i
zo^
te~
je^
o^
ra
kx^
ja
no^
s^a
z^x
fo~
do~
yo
lo^
rx^
o~
ze~
z^e^
z^a
do
ne~
r
bo^
me
pa~
je~
bi
so
mo~
mx^
vo~
fi
ji
zx^
du
ma~
fe^
ke~
na~
se~
z^o
ya
mo^
mo
k
s^a~
s^e^
fa
fe
s^o^
ye^
we
z^
gi
za~
po~
z^o~
vu
te
z^o^
tx^
to^
be
bo
go
zu
j
fo
ra
lu
lx^
ba
ve~
to~
ju
vx
ti
ya~
fx
re
bx
go~
da
ge
me~
y
mu
wi
sa
be
me^
fu
de~
t
ba~
gu
gne
s
v
s^o
z^e~
fx
d
ja~
s^o~
jo~
yx^
zx
z
vx^
ga~
pe~
yo^
nx^
ye~
mi
dx^
bo~
na
p
vo^
l
yx
sx^
gnx
se
ne
s^x
ge^
s^u
s^x^
gna
gx
fo
gni
gna~
ga
wo
s^e~
ye~
n
ve
be~
jx
ge~
je
ta~
me
m
te~
si
a
ro
ri
wx
ku
la
vo
gne^
f
lo
a~
le
z^e
s^
gn
go^
jx^
se~
we
mo
lo~
o^
fa
se^
ke
fx^
wa
do
px
ru
gno~
ro~
di
yu
vu
z^x^
ja
de
px^
gno
ze
fa~
wi
fe~
ke~
ze~
wa~
ba
yi
go
bx^
je^
gnu
g
e
gne~
z^e^
z^a
je~
no~
lu
va~
da~
o
ya~
ni
pe
lx
be^
so
le^
b
pa
fe^
to
ki
wo~
vi
z^i
ta
sx
zo~
to~
ye
ka
bi
li
i
pi
wu
za
ne^
we~
sa~
ko
z^a~
re^
s^e~
su
dx
z^o~
po
do~
le~
ge
yx
rx
bu
vo~
nx
s^e^
na~
te^
va
pe~
ra~
bo
gx^
la~
zo
so~
mo~
po~
e^
s^a~
fe
me~
de^
wo^
ga~
gno^
s^e
tu
fu
fi
nx^
ka~
ma
z^u
go~
jo
du
x
ye^
nu
wx^
s^i
no
zx
ji
ve~
ze^
zx^
mx^
fo~
ne~
re~
kx
yo
zi
bo~
ve^
ba~